xiangjianhe/MonitorPro/code/Project/Header/Foxconn/FOX_LS2233_CMI_M215HGE_L21.h
#define _FAIL_SAVE_H_FREQ_UPPER_BOUND                           1000       // Unit in 0.1 kHZ
#define _FAIL_SAVE_H_FREQ_LOWER_BOUND                           110        // Unit in 0.1 kHZ
#define _FAIL_SAVE_V_FREQ_UPPER_BOUND                           756        // Unit in 0.1 HZ
#define _FAIL_SAVE_V_FREQ_LOWER_BOUND                           495        // Unit in 0.1 HZ

#define _INPUTCLOCK_RANG_VGA                                    2100      // Unit in 0.1 MHz
#define _INPUTCLOCK_RANG_DVI                                    1650      // Unit in 0.1 MHz
#define _INPUTCLOCK_RANG_HDMI                                   2250      // Unit in 0.1 MHz


//-------------------------------------------------
// Definition of Auto Search STYLE 
//-------------------------------------------------
#define _SOURCE_AUTO_SEARCH_STYLE                               _SOURCE_POLLING_AFTER_NOSIGNAL_STATE                                

//-------------------------------------------------
// Definitions of Required Default Search Time when Using _SOURCE_POLLING_AFTER_NOSIGNAL_STATE
//-------------------------------------------------
#define _SOURCE_DEFAULT_SEARCH_TIME_VGA                         SEC(0.5)
#define _SOURCE_DEFAULT_SEARCH_TIME_TMDS                        SEC(2)

//-------------------------------------------------
// Define Required Wait Time Before Entering Active State
//-------------------------------------------------
#define _WAIT_TIME_TO_ACTIVE_VGA                                SEC(0.05)
#define _WAIT_TIME_TO_ACTIVE_DVI                                SEC(0.1)
#define _WAIT_TIME_TO_ACTIVE_HDMI                               SEC(0.1)


//--------------------------------------------------
// VGA YPBPR Support  
//--------------------------------------------------
#define _YPBPR_SUPPORT                                          _ON
#define _SOG_SUPPORT                                            _ON
#define _VGA_COMPOSITE_SUPPORT                                  _ON

//--------------------------------------------------
// VGA RGB/YPBPR Default Values  
//--------------------------------------------------
#define _ADC_RGB_DEFAULT_PGA_VALUE                              4   // 0 ~ 7
#define _ADC_RGB_DEFAULT_RED_GAIN                               128
#define _ADC_RGB_DEFAULT_GREEN_GAIN                             128
#define _ADC_RGB_DEFAULT_BLUE_GAIN                              128
#define _ADC_RGB_DEFAULT_RED_OFFSET                             128
#define _ADC_RGB_DEFAULT_GREEN_OFFSET                           128
#define _ADC_RGB_DEFAULT_BLUE_OFFSET                            128

#define _ADC_YPBPR_DEFAULT_PGA_VALUE                            4   // 0 ~ 7
#define _ADC_YPBPR_DEFAULT_Y_GAIN                               159
#define _ADC_YPBPR_DEFAULT_PB_GAIN                              154
#define _ADC_YPBPR_DEFAULT_PR_GAIN                              154
#define _ADC_YPBPR_DEFAULT_Y_OFFSET                             112
#define _ADC_YPBPR_DEFAULT_PB_OFFSET                            128
#define _ADC_YPBPR_DEFAULT_PR_OFFSET                            128

//--------------------------------------------------
// VGA SELF_CALIBRATION Support 
//--------------------------------------------------
#define _ADC_SELF_CALIBRATION                                   _ON
#define _CALIBRATION_R_GAIN_BIAS                                (0) // Needs modification for EVERY single source
#define _CALIBRATION_G_GAIN_BIAS                                (0) // Needs modification for EVERY single source
#define _CALIBRATION_B_GAIN_BIAS                                (0) // Needs modification for EVERY single source
#define _CALIBRATION_R_OFFSET_BIAS                              (0) // Needs modification for EVERY single source
#define _CALIBRATION_G_OFFSET_BIAS                              (0) // Needs modification for EVERY single source
#define _CALIBRATION_B_OFFSET_BIAS                              (0) // Needs modification for EVERY single source

//--------------------------------------------------
// VGA YPBPR Auto Color Method Select
//--------------------------------------------------
#define _YPBPR_AUTO_METHOD                                      _YPBPR_AUTO_BY_SOURCE
#define _AUTO_PB_GAIN_BIAS                                      (4)
#define _AUTO_PR_GAIN_BIAS                                      (4)
#define _AUTO_Y_GAIN_BIAS                                       (0)
#define _AUTO_PB_OFFSET_BIAS                                    (0)
#define _AUTO_PR_OFFSET_BIAS                                    (0)
#define _AUTO_Y_OFFSET_BIAS                                     (-16)

//--------------------------------------------------
// Auto Color Gain/offset Tolerance(128 +/- Tolerance)
//--------------------------------------------------
#define _ADC_WHITEBALANCE_TOLERANCE                             75

//--------------------------------------------------
// Auto Adjust Clock Setup
//--------------------------------------------------
#define _AUTO_CLOCK_STEP                                        2 // 1 or 2
#define _AUTO_CLOCK_RANGE                                       95 // Set Clock Non-adjusting Range (%) by the active region
#define _AUTO_TOLERANCE_PIXEL                                   2 // Definitions Of tolerance pixel for Auto Clock
#define _AUTO_CLOCK_SAVE_VALUE_OPTION                           _CLOCK_SAVE_PERCENT_VALUE

//-------------------------------------------------
// Define Max Adjustable H Position Range
//-------------------------------------------------
#define _MAX_H_POSITION_RANGE                                   100 // Pixel
#define _MAX_V_POSITION_RANGE                                   100 // Line

//--------------------------------------------------
// Definitions of Digital Filter
//--------------------------------------------------
#define _DIG_FILTER_PHASE_THD                                   192 //effective:0~255
#define _DIG_FILTER_PHASE_DIV_VALUE                             1 //effective:0~3

#define _DIG_FILTER_PHASE_ENABLE                                _ENABLE 
#define _DIG_FILTER_NSMEAR_ENABLE                               _ENABLE 
#define _DIG_FILTER_PSMEAR_ENABLE                               _ENABLE 
#define _DIG_FILTER_NRING_ENABLE                                _ENABLE 
#define _DIG_FILTER_PRING_ENABLE                                _ENABLE 
#define _DIG_FILTER_EXTENSION_ENABLE                            _ENABLE 
#define _DIG_FILTER_ENHANCE_PHASE_ENABLE                        _ENABLE

//-------------------------------------------------
// TMDS Options  
//-------------------------------------------------
#define _DVI_DE_ONLY_SUPPORT                                    _ON     
#define _HDMI_FROM_DVI_CONNECT                                  _ON 

//--------------------------------------------------
// TMDS CTS Options  
//--------------------------------------------------
#define _TMDS_HDCP_FEATURE                                      _HDCP_FEATURE_BY_INPUT   
#define _TMDS_Z0_POWER_SAVING_OPTION                            _ONLY_CLK_CHANNEL_CONNECTED_FOR_PS

//-------------------------------------------------
// EDID Options
//-------------------------------------------------
#if(_SYSTEM_EEPROM_EMULATION_SUPPORT == _OFF)
#define _EEPROM_EDID_A0_ADDRESS                                 (_EEPROM_PAGE7_BANK0)
#else
#define _EEPROM_EDID_A0_ADDRESS                                 (_MISC_PAGE * _FLASH_PAGE_SIZE)
#endif
#define _EEPROM_EDID_D0_ADDRESS                                 (_EEPROM_EDID_A0_ADDRESS + _EMBEDDED_DDCRAM_A0_SIZE)
#define _EEPROM_EDID_D1_ADDRESS                                 (_EEPROM_EDID_D0_ADDRESS + _EMBEDDED_DDCRAM_D0_SIZE)

//-------------------------------------------------
// HDCP Key Options
//-------------------------------------------------
#define _WRITE_HDCP_TO_SYSTEM_EEPROM                            _OFF
#define _HDCP_KEY_LOCATION                                      _TABLE_LOCATION_SYSTEM_EEPROM
#if(_SYSTEM_EEPROM_EMULATION_SUPPORT == _OFF)
#define _EEPROM_HDCP_KEY_ADDRESS                                (_EEPROM_PAGE6_BANK1)
#else
#define _EEPROM_HDCP_KEY_ADDRESS                                (_EEPROM_EDID_D1_ADDRESS + _EMBEDDED_DDCRAM_D1_SIZE)
#endif

//-------------------------------------------------
// Instant Timer Events Options
// Add ?PR?USERINTERFACETIMER0INSTANTACCESS_TIMER0?RTD2011USERINTERFACE
//     ?PR?USERINTERFACETIMER1INSTANTACCESS_TIMER1?RTD2011USERINTERFACE
// To Link File Bank 0 In Order to Increase Efficiency
//-------------------------------------------------
#define _INSTANT_TIMER_EVENT_0                                  _OFF

#if(_DCR_SUPPORT == _ON)
#define _INSTANT_TIMER_EVENT_1                                  _ON
#else
#define _INSTANT_TIMER_EVENT_1                                  _OFF
#endif
//--------------------------------------------------
// Definitions of _VGA_CHROMA_PATTERN12_SUPPORT
//--------------------------------------------------
#define _VGA_CHROMA_PATTERN12_SUPPORT                           _ON
//--------------------------------------------------
// High Charge Pump Current for 25MHz --> only effected in RL6096
//--------------------------------------------------
#define _TMDS_25M_HIGH_CHARGE_PUMP_CURRENT                      _ON

//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
// Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
// Factory Mode Owner
//----------------------------------------------------------------------------------------------------
#define _OWNER_NONE										0
#define _OWNER_RTK										1
#define _OWNER_TPV										2
#define _OWNER_FOXCONN                                  3 
#define _OWNER_WISTRON       					        4

//-------------------------------------------------
// Digital Port Setting for OSD Input source switch sub menu.
// Description  : The _DVI_PORT,_HDMI_PORT,_DP_PORT,_NONE_PORT defines can't be changed.
//-------------------------------------------------
#define _DVI_PORT                                       2//_SOURCE_DVI
#define _HDMI_PORT                                      3//_SOURCE_HDMI
#define _DP_PORT                                        4//_SOURCE_DP
#define _NONE_PORT                                      5//_SOURCE_NONE
//--------------------------------------------------
// Definitions for Language Logo setting 
//--------------------------------------------------
#define _NONE_LOGO										0
#define _IBM_THINKVISION_LENOVO							1
#define _LENOVO											2
#define _LENOVO_THINKVISION								3
#define _LENOVO_THINKVISION_EPA							4
#define _LENOVO_2015                                    5
#define _LENOVO_2015_EPA                                6

//----------------------------------------------------------------------------------------------------
// Definitions for Language Type setting 
//----------------------------------------------------------------------------------------------------
#define _8_LAN                                          0//_ENGLISH,_FRENCH,_ITALIAN,_CHINESE_S,_SPANISH,_JAPAN,_GERMAN,_RUSSIAN,
#define _2_LAN                                          1//_CHINESE_S,_ENGLISH

//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
#define _FACTORY_MODE_OWNER								_OWNER_FOXCONN
#define _OSD_ROTATE_FUNCTION							_OFF
#define OOR_DCLK_CHECK                                  _OFF// Definitions of OOR Dclk Auto Adjust
#define _INPUT_PORT_MAX                                 2
#define _DIGITAL1_TYPE                                  _DVI_PORT
#define _DIGITAL2_TYPE                                  _NONE_PORT
#define _LOGO_TYPE                                      _LENOVO//_IBM_THINKVISION_LENOVO
#define _LANGUAGE_TYPE                                  _8_LAN
#define _LANGUAGE_DEFAULT                               _ENGLISH
#define _USER_DCR_FUNCTION							    _OFF

#if((_LOGO_TYPE == _IBM_THINKVISION_LENOVO) || (_LOGO_TYPE == _LENOVO))
#define _EPA_LOGO                                       _OFF
#endif

#define _LOW_BLUE_LIGHT_FUNCTION                         _ON

//--------------------------------------------------
// Definitions of LBL hot key OSD H Position Range
//--------------------------------------------------
#define _OSD_LBL_H_POS                                  904
#define _OSD_LBL_V_POS                                  8

//--------------------------------------------------
// Version Code of NVRam
//--------------------------------------------------
#define _CHECKSUM                                       0xB6
#define _VERSION_CODE                                   0xaf

//Facory OSD
#define _FACTORY_PROJECT_NAME                           _L,_S,_2,_2,_3,_3,_SPACE,_W,_i,_d,_e
#define _FACTORY_PANNEL_NAME							_C,_M,_I,_SPACE,_M,_2,_1,_5,_H,_G,_E,_L,_2,_1
#define _IC_SERIES                                      _R,_T,_D,_2,_2,_8,_1,_C,_L
#define _FW_RELEASE_DATE                                _2,_0,_1,_5,_0,_7,_0,_3
#define _FW_VERSION                                     _L,_M, _2, _DOT, _0
#define _DDCCI_FIRMWARE_VERSION							0x0200//	0x0301 

//User OSD
#define _MODEL_NAME                                     _bL_, _bS_,_b2_, _b2_, _b3_, _b3_, ___,_bW_,_bi_,_bd_,_be_
#define _MICROCODE                                      _bL_,_bM_, _b2_, _DOT, _b0_
//Facory Command
#define FacoryVersion1                                  'L' //Facory Command show Version
#define FacoryVersion2                                  'M' //Facory Command show Version
#define FacoryVersion3                                  '2' //Facory Command show Version
#define FacoryVersion4                                  '.' //Facory Command show Version
#define FacoryVersion5                                  '0' //Facory Command show Version

#define FacoryBomH1                                     '7'
#define FacoryBomH2                                     '9'
#define FacoryBomH3                                     '0'
#define FacoryBomH4                                     'F'
#define FacoryBomH5                                     'H'
#define FacoryBomH6                                     '1'
#define FacoryBomH7                                     '3'
#define FacoryBomH8                                     '0'

#define FacoryBomL1                                     '0'
#define FacoryBomL2                                     '6'
#define FacoryBomL3                                     '0'
#define FacoryBomL4                                     '0'
#define FacoryBomL5                                     'R'
#define FacoryBomL6                                     '0'
#define FacoryBomL7                                     '0'

//----------------------------------------------------------------------------------------------------
// Definitions for Panel Contrast
//----------------------------------------------------------------------------------------------------
#define _COLOR_TEMP_DEF									_CT_6500

#define _OSD_CONTRAST_DEF_VALUE                         85    //_CONTRAST_VGA
#define _OSD_BRIGHTNESS_DEF_VALUE                       80

//LowBlueLight Contrast Backlight  DEF
#define _LBL_CONTRAST_DEF                               85    
#define _LBL_BRIGHTNESS_DEF                             80

#define _CONTRAST_CHANG_POINT_ANALOG					102
#define _CONTRAST_MAX_ANALOG							116
#define _CONTRAST_MIN_ANALOG							40

